START_MESSAGE = """
💭 سلام ، به ربات تلگرامی رهگیری مرسولات پستی خوش آمدید.
برای رهگیری بسته پستی خود ، لطفا کد رهگیری تان را ارسال نمایید.
"""


DONATION_MESSAGE = """
🌱 حمایت:
این ربات یک پروژه آزاد و رایگان است که ارتباطی با هیچ شرکت یا سازمانی ندارد و به صورت شخصی نگهداری می‌شود.
برای حمایت مالی از ربات بابت هزینه های نگهداری و توسعه ، می‌توانید از لینک ها‌ی زیر اقدام کنید :

https://daramet.com/amiraref

✨ همچنین از آنجایی که این یک پروژه متن‌باز است ، در صورت تمایل می‌توانید به صفحه این پروژه (ها) در گیتهاب star بدهید :

https://github.com/AmirAref/post-tracker-bot
https://github.com/AmirAref/post-tracker

🌺 با تشکر از حمایت شما
"""


WAITING_MESSAGE = """
🌐 در حال دریافت اطلاعات ، لطفا منتظر بمانید ...
"""

TRACKING_NOT_FOUND = """
❌ اطلاعاتی درباره کد رهگیری ارسال شده وجود ندارد.
"""

UNHANDLED_ERROR = """
‼️ خطایی غیر منتظره رخ داد ، لطفا مدتی بعد امتحان کنید.
در صورت تکرار ، به سازندگان [گزارش](https://github.com/AmirAref/post-tracker-bot/issues) دهید.
"""

TRACKING_STATUS = """
📆 تاریخ : {date}
⏰ زمان : {time}
🏣 موقعیت : {location}
📮 وضعیت : {status}
"""

ALERT_UPDATE_SUCCESS = """
✅ آخرین وضعیت مرسوله با موفقیت دریافت شد
"""

ALERT_UPDATE_ERROR = """
❌ مشکلی در به روز رسانی به وجود آمده است
"""


ALERT_UPDATE_NOT_MODIFIED = """
ℹ️ آخرین وضعیت مرسوله تغییری نکرده است
"""

UPDATE_BUTTON_TEXT = "🔄 به‌روزرسانی"
